Revit 2026 API

# SpaceVolume Property

---

Get the Volume of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Volume { get; }
```
```vb
Public ReadOnly Property Volume As Double
	Get
```
```cpp
public:
property double Volume {
	double get ();
}
```
```fsharp
member Volume : float with get
```

#### Property Value

Double

This property is used to get the Volume of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace